Autodesk.Revit.DB.Structure.RebarBendingDetail.IsBendingDetail(Autodesk.Revit.DB.Element)
Checks if the input element is a bending detail.
bendingDetail:
The element that will be checked.
Returns:
Returns true if the input element is a bending detail, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The bendingDetail should be a bending detail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetail.SetRotation(Autodesk.Revit.DB.Element,System.Double)
Sets the rotation angle in radians for the bending detail relative to its view.
bendingDetail:
The bending detail for which we want to get the rotation.
rotation:
The new rotation angle of the bending detail relative to its view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
-or-
The given value for rotation is not a number
-or-
The given value for rotation is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetail.SetPosition(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ)
Sets the position for this bending detail relative to its view.
bendingDetail:
The bending detail for which we want to get the position.
position:
The new position for this bending detail relative to its view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetail.GetRotation(Autodesk.Revit.DB.Element)
Gets the rotation angle in radians for the bending detail relative to its view.
bendingDetail:
The bending detail for which we want to get the rotation.
Returns:
Returns the rotation angle in radians for the bending detail relative to its view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetail.GetPosition(Autodesk.Revit.DB.Element)
Gets the position of the bending detail relative to its view.
bendingDetail:
The bending detail for which we want to get the position.
Returns:
Returns the position of the bending detail relative to its view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetail.GetHost(Autodesk.Revit.DB.Element)
Gets a reference to the reinforcement element that this bending detail represent.
bendingDetail:
The bending detail for which we want to get the host.
Returns:
Returns a reference pointing to the reinforcement element represented by the input bending detail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetail.SetHost(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Reference)
Sets the reinforcement element that will be represented by the input bending detail.
bendingDetail:
The bending detail for which we want to set the host.
reference:
Reference pointing to the reinforcement element that will be represented by the input bending detail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetail.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.Structure.RebarBendingDetailType,Autodesk.Revit.DB.XYZ,System.Double)
Creates a new instance of a bending detail.
document:
Document to which the new element should be added.
viewId:
The id of the view in which the new element should be added.
reinforcementElementId:
The reinforcement element Id that this object will represent.
reinforcementElementSubelementKey:
The index of the sub-element from the reinforcement element that this object will represent.
bendingDetailType:
The bending details type used with the resulting object.
position:
The initial position in the view where this object will be created.
rotation:
The initial rotation in the view for this element.
Returns:
Returns an instance of a bending detail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetail
Utility class with methods needed for the bending details in view.
Since:
2024